In [21]:
!pip install tabulate

Requirement already satisfied: tabulate in c:\users\youcode\anaconda3\lib\site-packages (0.8.10)

In [25]:
!pip install scikit-learn

Collecting scikit-learn
  Downloading scikit_learn-1.3.0-cp311-cp311-win_amd64.whl (9.2 MB)
     ---------------------------------------- 0.0/9.2 MB ? eta -:--:--
     ---------------------------------------- 0.1/9.2 MB 3.2 MB/s eta 0:00:03
     - -------------------------------------- 0.3/9.2 MB 3.5 MB/s eta 0:00:03
     - -------------------------------------- 0.3/9.2 MB 2.7 MB/s eta 0:00:04
     - -------------------------------------- 0.4/9.2 MB 2.4 MB/s eta 0:00:04
     -- ------------------------------------- 0.5/9.2 MB 2.2 MB/s eta 0:00:04
     --- ------------------------------------ 0.7/9.2 MB 2.7 MB/s eta 0:00:04
     ---- ----------------------------------- 0.9/9.2 MB 2.9 MB/s eta 0:00:03
     ---- ----------------------------------- 1.0/9.2 MB 2.7 MB/s eta 0:00:04
     ----- ---------------------------------- 1.2/9.2 MB 3.0 MB/s eta 0:00:03
     ------ --------------------------------- 1.4/9.2 MB 3.2 MB/s eta 0:00:03
     ------- -------------------------------- 1.6/9.2 MB 3.3 MB/s eta 0:00:03
     -------- ------------------------------- 1.9/9.2 MB 3.4 MB/s eta 0:00:03
     -------- ------------------------------- 2.0/9.2 MB 3.4 MB/s eta 0:00:03
     --------- ------------------------------ 2.1/9.2 MB 3.4 MB/s eta 0:00:03
     --------- ------------------------------ 2.2/9.2 MB 3.2 MB/s eta 0:00:03
     ---------- ----------------------------- 2.3/9.2 MB 3.3 MB/s eta 0:00:03
     ---------- ----------------------------- 2.4/9.2 MB 3.1 MB/s eta 0:00:03
     ---------- ----------------------------- 2.5/9.2 MB 3.0 MB/s eta 0:00:03
     ----------- ---------------------------- 2.5/9.2 MB 2.9 MB/s eta 0:00:03
     ----------- ---------------------------- 2.6/9.2 MB 2.8 MB/s eta 0:00:03
     ----------- ---------------------------- 2.7/9.2 MB 2.7 MB/s eta 0:00:03
     ----------- ---------------------------- 2.7/9.2 MB 2.7 MB/s eta 0:00:03
     ------------ --------------------------- 2.8/9.2 MB 2.7 MB/s eta 0:00:03
     ------------ --------------------------- 2.8/9.2 MB 2.6 MB/s eta 0:00:03
     ------------ --------------------------- 2.9/9.2 MB 2.5 MB/s eta 0:00:03
     ------------ --------------------------- 3.0/9.2 MB 2.5 MB/s eta 0:00:03
     ------------- -------------------------- 3.0/9.2 MB 2.5 MB/s eta 0:00:03
     ------------- -------------------------- 3.1/9.2 MB 2.4 MB/s eta 0:00:03
     ------------- -------------------------- 3.2/9.2 MB 2.4 MB/s eta 0:00:03
     -------------- ------------------------- 3.3/9.2 MB 2.4 MB/s eta 0:00:03
     -------------- ------------------------- 3.3/9.2 MB 2.3 MB/s eta 0:00:03
     -------------- ------------------------- 3.4/9.2 MB 2.3 MB/s eta 0:00:03
     --------------- ------------------------ 3.5/9.2 MB 2.3 MB/s eta 0:00:03
     --------------- ------------------------ 3.6/9.2 MB 2.3 MB/s eta 0:00:03
     --------------- ------------------------ 3.7/9.2 MB 2.3 MB/s eta 0:00:03
     ---------------- ----------------------- 3.7/9.2 MB 2.3 MB/s eta 0:00:03
     ---------------- ----------------------- 3.9/9.2 MB 2.3 MB/s eta 0:00:03
     ----------------- ---------------------- 3.9/9.2 MB 2.2 MB/s eta 0:00:03
     ----------------- ---------------------- 4.0/9.2 MB 2.2 MB/s eta 0:00:03
     ----------------- ---------------------- 4.1/9.2 MB 2.2 MB/s eta 0:00:03
     ------------------ --------------------- 4.2/9.2 MB 2.2 MB/s eta 0:00:03
     ------------------ --------------------- 4.3/9.2 MB 2.2 MB/s eta 0:00:03
     ------------------- -------------------- 4.4/9.2 MB 2.2 MB/s eta 0:00:03
     ------------------- -------------------- 4.5/9.2 MB 2.2 MB/s eta 0:00:03
     -------------------- ------------------- 4.6/9.2 MB 2.2 MB/s eta 0:00:03
     -------------------- ------------------- 4.7/9.2 MB 2.2 MB/s eta 0:00:03
     --------------------- ------------------ 4.8/9.2 MB 2.2 MB/s eta 0:00:02
     --------------------- ------------------ 4.9/9.2 MB 2.2 MB/s eta 0:00:02
     ---------------------- ----------------- 5.1/9.2 MB 2.2 MB/s eta 0:00:02
     ---------------------- ----------------- 5.2/9.2 MB 2.2 MB/s eta 0:00:02
     ----------------------- ---------------- 5.3/9.2 MB 2.2 MB/s eta 0:00:02
     ----------------------- ---------------- 5.4/9.2 MB 2.2 MB/s eta 0:00:02
     ------------------------ --------------- 5.6/9.2 MB 2.3 MB/s eta 0:00:02
     ------------------------ --------------- 5.7/9.2 MB 2.3 MB/s eta 0:00:02
     ------------------------- -------------- 5.8/9.2 MB 2.3 MB/s eta 0:00:02
     ------------------------- -------------- 5.9/9.2 MB 2.3 MB/s eta 0:00:02
     -------------------------- ------------- 6.1/9.2 MB 2.3 MB/s eta 0:00:02
     -------------------------- ------------- 6.2/9.2 MB 2.3 MB/s eta 0:00:02
     --------------------------- ------------ 6.3/9.2 MB 2.3 MB/s eta 0:00:02
     ---------------------------- ----------- 6.4/9.2 MB 2.3 MB/s eta 0:00:02
     ---------------------------- ----------- 6.6/9.2 MB 2.3 MB/s eta 0:00:02
     ----------------------------- ---------- 6.7/9.2 MB 2.3 MB/s eta 0:00:02
     ----------------------------- ---------- 6.8/9.2 MB 2.3 MB/s eta 0:00:02
     ------------------------------ --------- 7.0/9.2 MB 2.3 MB/s eta 0:00:01
     ------------------------------- -------- 7.1/9.2 MB 2.4 MB/s eta 0:00:01
     ------------------------------- -------- 7.3/9.2 MB 2.4 MB/s eta 0:00:01
     -------------------------------- ------- 7.4/9.2 MB 2.4 MB/s eta 0:00:01
     -------------------------------- ------- 7.6/9.2 MB 2.4 MB/s eta 0:00:01
     --------------------------------- ------ 7.7/9.2 MB 2.4 MB/s eta 0:00:01
     ---------------------------------- ----- 7.9/9.2 MB 2.4 MB/s eta 0:00:01
     ---------------------------------- ----- 8.0/9.2 MB 2.4 MB/s eta 0:00:01
     ----------------------------------- ---- 8.2/9.2 MB 2.4 MB/s eta 0:00:01
     ------------------------------------ --- 8.4/9.2 MB 2.5 MB/s eta 0:00:01
     ------------------------------------- -- 8.5/9.2 MB 2.5 MB/s eta 0:00:01
     ------------------------------------- -- 8.7/9.2 MB 2.5 MB/s eta 0:00:01
     -------------------------------------- - 8.8/9.2 MB 2.5 MB/s eta 0:00:01
     ---------------------------------------  9.0/9.2 MB 2.5 MB/s eta 0:00:01
     ---------------------------------------  9.2/9.2 MB 2.5 MB/s eta 0:00:01
     ---------------------------------------- 9.2/9.2 MB 2.5 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.17.3 in c:\users\youcode\anaconda3\envs\venv\lib\site-packages (from scikit-learn) (1.24.3)
Requirement already satisfied: scipy>=1.5.0 in c:\users\youcode\anaconda3\envs\venv\lib\site-packages (from scikit-learn) (1.11.1)
Collecting joblib>=1.1.1
  Downloading joblib-1.3.1-py3-none-any.whl (301 kB)
     ---------------------------------------- 0.0/302.0 kB ? eta -:--:--
     ------------------------ ------------- 194.6/302.0 kB 3.9 MB/s eta 0:00:01
     -------------------------------------- 302.0/302.0 kB 3.7 MB/s eta 0:00:00
Collecting threadpoolctl>=2.0.0
  Downloading threadpoolctl-3.2.0-py3-none-any.whl (15 kB)
Installing collected packages: threadpoolctl, joblib, scikit-learn
Successfully installed joblib-1.3.1 scikit-learn-1.3.0 threadpoolctl-3.2.0

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Exploration & Compr√©hension

In [2]:
data = pd.read_csv("jobs.csv", encoding="latin-1")
data.head()

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
0,SGS,Clinical Data Analyst,"Richardson, TX, United States",Full Time,Entry-level,48K+ *,"Computer Science,Data quality,Genetics,Mathema...",",,,,"
1,Ocorian,AML/CFT & Data Analyst,"Eb√®ne, Mauritius",Full Time,Entry-level,48K+ *,"Agile,Data management,Finance,Security,,",",,,,"
2,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,NaN,90K+ *,"Agile,Architecture,AWS,Computer Science,Comput...","Career development,,,,"
3,Bosch Group,Application Developer & Data Analyst,"Nonantola, Italy",Full Time,Entry-level,48K+ *,"Engineering,Industrial,Oracle,Power BI,R,R&D",",,,,"
4,Publicis Groupe,Data Engineer Full time (Public Sector) USA,"Arlington, VA, United States",Full Time,Mid-level,108K+,"AWS,Azure,Computer Science,Consulting,Dataflow...","Flex hours,Flex vacation,Parental leave,Unlimi..."

In [3]:
data.shape

(3198, 8)

Nous avons un dataset de 3198 entr√©es et 8 champs

In [4]:
data.dtypes

Company                       object
Job Title                     object
Location                      object
Job Type                      object
Experience level              object
Salary                        object
Requirment of the company     object
Facilities                    object
dtype: object

Toutes les variables sont des objets. Bon √† savoir !

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3198 entries, 0 to 3197
Data columns (total 8 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Company                     3197 non-null   object
 1   Job Title                   3197 non-null   object
 2   Location                    3197 non-null   object
 3   Job Type                    3197 non-null   object
 4   Experience level            2962 non-null   object
 5   Salary                      3009 non-null   object
 6   Requirment of the company   3198 non-null   object
 7   Facilities                  3198 non-null   object
dtypes: object(8)
memory usage: 200.0+ KB

- Compr√©hension & Analyse: Nous avons 3198 entr√©es. 
    - Seules les colonnes "Facilities" et "Requirment of company" sont toutes bien remplies
    - Les colonnes "Company", "Job Title", "Location" ont seulement une valeur manquante
    - La colonne "Experience level" a 2962 entr√©es sur 3198. Donc pr√®s de 93% de valeurs remplies et 7% de valeurs manquantes 
    - La colonne "Salary" a 3009 entr√©es sur 3198. Donc 94% de valeurs remplies et 6% de valeurs manquantes

In [6]:
# Afficher un r√©sum√© statistique du DataFrame
summary = data.describe(include='all')
summary

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
count,3197,3197,3197,3197,2962,3009,3198,3198
unique,1106,2138,1117,3,4,218,2600,777
top,Publicis Groupe,Data Engineer,"Bengaluru, India",Full Time,Senior-level,115K+ *,"Big Data,Business Intelligence,Data analysis,E...",",,,,"
freq,126,105,90,3116,1876,253,12,542

- "count": Cela indique le nombre total de valeurs non manquantes (non nulles) dans chaque colonne du DataFrame. Par exemple, il y a 3197 valeurs non manquantes pour la colonne "Company", "Job Title", "Location", etc.

- "unique": Cela repr√©sente le nombre d'√©l√©ments uniques dans chaque colonne du DataFrame. Par exemple, il y a 1106 entreprises uniques, 2138 titres de poste uniques, 1117 emplacements uniques, etc.

- "top": Cela indique la valeur la plus fr√©quente (top) dans chaque colonne. Par exemple, "Publicis Groupe" est l'entreprise la plus fr√©quente dans la colonne "Company", "Data Engineer" est le titre de poste le plus fr√©quent, "Bengaluru, India" est le lieu le plus fr√©quent, etc.

- "freq": Cela repr√©sente la fr√©quence (nombre d'occurrences) de la valeur la plus fr√©quente (top) dans chaque colonne. Par exemple, "Publicis Groupe" appara√Æt 126 fois dans la colonne "Company", "Data Engineer" appara√Æt 105 fois dans la colonne "Job Title", "Bengaluru, India" appara√Æt 90 fois dans la colonne "Location", etc.

Une remarque: Nous n'avons pas de valeurs num√©riques !

# Data Cleaning

Cette √©tape consiste √† nettoyer les donn√©es en corrigeant les erreurs, en supprimant les impuret√©s pour ne conserver que les valeurs propres, correctes, utiles et pertinentes. Nous serons amen√©s √†:
- G√©rer les doublons
- G√©rer les valeurs manquantes
- G√©rer les valeurs ab√©rrantes et atypiques

### Gestion des doublons

In [7]:
data.duplicated().sum()

202

Nous avons 202 doublons. Nous allons les supprimer pour √©viter les conflits de donn√©es.

In [8]:
data.drop_duplicates(inplace = True)
data.duplicated().sum()

0

Les doublons ont bien √©t√© supprim√©s

### Gestion des valeurs manquantes

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2996 entries, 0 to 3196
Data columns (total 8 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Company                     2995 non-null   object
 1   Job Title                   2995 non-null   object
 2   Location                    2995 non-null   object
 3   Job Type                    2995 non-null   object
 4   Experience level            2768 non-null   object
 5   Salary                      2824 non-null   object
 6   Requirment of the company   2996 non-null   object
 7   Facilities                  2996 non-null   object
dtypes: object(8)
memory usage: 210.7+ KB

Nous avons √† pr√©sent 2996 entr√©es.
- Les colonnes "Company", "Job Title", "Location", "Job Type" ont 2995 entr√©es donc ont 01 valeur manquante.
- La colonne "Experience level" poss√®de 2768 entr√©es donc elle poss√®de 228 valeurs manquantes soit environ 7,6% 
- La colonne "Salary" a 2824 entr√©es. Elle a donc 172 valeurs manquantes soit 5,7%

### Colonne Company

In [10]:
missing_values_count = data["Company"].isna().sum()
print("Number of missing values in 'Company' column:", missing_values_count)

Number of missing values in 'Company' column: 1

In [11]:
data.loc[data["Company"].isna()]

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
797,NaN,NaN,NaN,NaN,NaN,NaN,",,,,,",",,,,"

### La ligne n'a aucune information qui soit utile. Nous allons donc la supprimer

In [12]:
# Supprimer les lignes o√π "Company" est NaN et mettre √† jour le DataFrame data
data.dropna(subset=["Company"], inplace=True)

# V√©rification
data.loc[data["Company"].isna()]

Empty DataFrame
Columns: [Company, Job Title, Location, Job Type, Experience level, Salary, Requirment of the company , Facilities]
Index: []

La ligne ligne a bien √©t√© supprim√©e. Passons √† la colonne Job Title

### Colonne Job Title

In [13]:
data["Job Title"].isna().sum()

0

### Colonne Location

In [14]:
data["Location"].isna().sum()

0

### Colonne Job Type

In [15]:
data["Job Type"].isna().sum()

0

Les valeurs manquantes des colonnes Job Type, Location,Job Title et Company √©taient dans la meme entr√©e et la ligne est d√©sormais supprim√©e.
- Passons √† la colonne Experience level

### Experience level

In [16]:
data["Experience level"].isna().sum()

227

Il y a exactement 227 valeurs manquantes. Allons-nous les supprimer ? Nous allons √©viter au maximum de supprimer. Nous allons tenter une amputation.

In [17]:
data["Experience level"]

0        Entry-level
1        Entry-level
2                NaN
3        Entry-level
4          Mid-level
            ...
3190       Mid-level
3191       Mid-level
3192    Senior-level
3193     Entry-level
3196     Entry-level
Name: Experience level, Length: 2995, dtype: object

In [18]:
# Obtenir le nombre d'occurrences de chaque valeur unique dans la colonne "Experience level"
experience_counts = data["Experience level"].value_counts()

# Obtenir la valeur la plus fr√©quente dans la colonne "Experience level" (en cas d'√©galit√©, on prend la premi√®re)
most_frequent_experience = experience_counts.idxmax()
most_frequent_experience
# # Remplacer les valeurs NaN par la valeur la plus fr√©quente dans la colonne "Experience level"
# data["Experience level"] = data["Experience level"].fillna(most_frequent_experience)

# # Afficher le nombre d'occurrences de chaque valeur unique dans la colonne "Experience level"
# print("Nombre d'occurrences de chaque valeur unique dans la colonne 'Experience level':")
# print(experience_counts)

# # Afficher le DataFrame mis √† jour avec les valeurs NaN remplac√©es
# print("\nDataFrame mis √† jour avec les valeurs NaN remplac√©es:")
# print(data["Experience level"])

'Senior-level'

In [19]:
xp_level = data.loc[data["Experience level"].isna()]
xp_level

,Company,Job Title,Location,Job Type,Experience level,Salary,Requirment of the company,Facilities
2,Cricut,Machine Learning Engineer,"South Jordan, UT, United States",Full Time,NaN,90K+ *,"Agile,Architecture,AWS,Computer Science,Comput...","Career development,,,,"
11,NielsenIQ,Data Analyst - Revenue Optimizer,"Toronto, ON, Canada",Full Time,NaN,80K+ *,"Business Analytics,Business Intelligence,Data ...","Career development,Startup environment,,,"
18,Issuu,BI Analyst,Braga,Full Time,NaN,48K+ *,"Business Analytics,Business Intelligence,Data ...","Competitive pay,Equity,Health care,Insurance,"
36,Bosch Group,Data Science Lead (Hybrid),"Mount Prospect, IL, United States",Full Time,NaN,63K+ *,"A/B testing,Data visualization,Economics,Engin...","Career development,Competitive pay,Health care,,"
69,SSENSE,"Data Analyst, Customer Experience","Montreal, QC, Canada",Full Time,NaN,80K+ *,"Business Intelligence,Computer Science,CX,Data...","Career development,Startup environment,,,"
...,...,...,...,...,...,...,...,...
3149,Syngenta Group,Agronomy Data Scientist (M/W) - CDI,"Saint-Sauveur, France",Full Time,NaN,90K+ *,"Computer Science,D3,Data analysis,Data Mining,...","Career development,,,,"
3157,Precision for Medicine,Data Engineer,"Remote, United States",Full Time,NaN,70K+,"AWS,Biology,Data management,Git,Linux,MySQL","Health care,Insurance,Parental leave,Salary bo..."
3163,Informa Group Plc.,Data Operations Engineer,"Toronto, ON, Canada",Full Time,NaN,60K+ *,"Agile,AWS,DataOps,Engineering,ETL,Pipelines","Career development,Flex hours,Flex vacation,He..."
3172,Precision Medicine Group,Data Engineer,"Remote, United States",Full Time,NaN,70K+,"AWS,Biology,Data management,Git,Linux,MySQL","Health care,Insurance,Parental leave,Salary bo..."
3177,MUFG Investor Services,Data Engineer (Contractor),"Limassol, Cyprus",Full Time,NaN,95K+ *,"Agile,Computer Science,Engineering,ETL,Python,","Competitive pay,,,,"

In [20]:
import pandas as pd

# Sp√©cifiez l'encodage appropri√© (par exemple, "latin-1")
data = pd.read_csv("jobs.csv", encoding="latin-1")

# Remplacer les valeurs manquantes par "No Experience"
data["Experience level"].fillna("No Experience", inplace=True)

# Afficher le DataFrame mis √† jour
print(data["Experience level"].isnull().sum())

0

### Colonne Salary

In [21]:
data["Salary"].isnull().sum()

189

Nous avons 189 entr√©es manquantes dans la colonne Salary. Nous allons tenter une imputation. Pour le moment, nous allons remplacer les valeurs manquantes par "No Salary"

In [22]:
data["Salary"].fillna("No Salary", inplace = True)
print(data["Salary"].isnull().sum())

0

Il n'existe plus de valeurs manquantes

#### Gestion de valeurs manquantes termin√©es !

## Gestion des valeurs Ab√©rrantes